aaron-bond.better-comments
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
GrapeCity.gc-excelviewer
GraphQL.vscode-graphql
hashicorp.terraform
HookyQR.beautify
huizhou.githd
ipedrazas.kubernetes-snippets
jasonnutter.search-node-modules
k--kato.intellij-idea-keybindings
kumar-harsh.graphql-for-vscode
mads-hartmann.bash-ide-vscode
mikestead.dotenv
mkxml.vscode-filesize
mohsen1.prettify-json
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
Orta.vscode-jest
Prisma.prisma
redhat.vscode-commons
redhat.vscode-yaml
sandcastle.vscode-open
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
william-voyek.vscode-nginx
wix.vscode-import-cost
wwm.better-align
xyz.local-history
Zignd.html-css-class-completion
