aaron-bond.better-comments
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
GrapeCity.gc-excelviewer
HookyQR.beautify
huizhou.githd
ipedrazas.kubernetes-snippets
k--kato.intellij-idea-keybindings
kiteco.kite
kumar-harsh.graphql-for-vscode
mauve.terraform
mikestead.dotenv
mohsen1.prettify-json
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
Orta.vscode-jest
redhat.vscode-yaml
sandcastle.vscode-open
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
TabNine.tabnine-vscode
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
xyz.local-history
Zignd.html-css-class-completion
